app/controllers/contacts_controller.rb

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "contacts" SET "name" = $1, "email" = $2, "phone" = $3, "updated_at" = $4 WHERE "contacts"."id" = $5  [["name", "Chuck Norri"], ["email", ""], ["phone", ""], ["updated_at", "2015-10-14 21:08:44.716932"], ["id", 1]]
---
  def update
    @contact = Contact.find(params[:id])
    if @contact.update(params[:contact])

SELECT "contacts".* FROM "contacts"  ORDER BY "contacts"."name" ASC
---
  def index
      @contacts = Contact.order(:name)

INSERT INTO "contacts" ("name", "email", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Mike Wizowski"], ["email", "mike@aol.com"], ["phone", "7843990202"], ["created_at", "2015-10-14 17:51:59.588824"], ["updated_at", "2015-10-14 17:51:59.588824"]]
SELECT "contacts".* FROM "contacts"  ORDER BY "contacts"."name" ASC
---
  def create
    @contact = Contact.new(params[:contact])

    if @contact.save
      render('contacts/success.html.erb')
    else
      @contacts = Contact.order(:name)