app/controllers/phones_controller.rb

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT 1  [["id", 4]]
---
    def new
      contact = Contact.find(params[:contact_id])